/* Задача 30: Напишите программу, которая выводит массив из 8 элементов, заполненный нулями и единицами в случайном порядке.
[1,0,1,1,0,1,0,0] */

int genetageArray()
{
    array = 0
}

int array[];


int array[] = 0;

void showData(int [] array)
{
    Console.Write("[");
    for (int = 0; i < array.Length ; i++)
    {
        Console.Write
    }

}
Console.Write(messageStart);
Console.ForegroundColor = ConsoleColor.DarkGreen;
Console.Write (data);
Console. ResetColor();